src/test/cloudmail-api-positive-test.yml
# File: crc-test.yml
# Project: Credit Repair Cloud
# File Created: Tuesday,  14-12-2021, 09:30 am
# Author: Karthik Hebbar A
# Last Modified: Thursday, 16-12-2021, 05:58 pm
# Modified By: Karthik Hebbar A<karthik.hebbar@altorumleren.com>
# This script contains the artillery automation scripts for cloud mail api's for the positive scenario

config:
  ensure:
    max: 1000
  target: "http://10.1.1.76:9000"
  processor: "../../generic-helper.js"
  plugins:
    expect: {}
    metrics-by-endpoint:
      useOnlyRequestNames: true

  phases:
    - duration: 1
      arrivalRate: 1
    #   name: Warm up
    # - duration: 10
    #   arrivalRate: 5
    #   rampTo: 10
    #   name: Ramp up load
    # - duration: 20
    #   arrivalRate: 10
    #   name: Sustained load

scenarios:
  - name: "Functional Testing"
    flow:

      - log: "we started to verify the address"
      - post:
          url: "/api/address/verify"
          name: "Verify Address"
          beforeRequest: "addJsonDataforAddressVerify"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postAddressVerifyResponse
          expect:
            - statusCode: 200
      - log: "this is the data what we have got from the server: {{postAddressVerifyResponse}}"

      - log: "we started to create the wallet"
      - post:
          url: "/api/wallet"
          name: "Create Wallet"
          beforeRequest: "addJsonDataforCreateWallet"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postCreateWalletResponse
          expect:
            - statusCode: 201
      - log: "this is the data what we have got from the server: {{postCreateWalletResponse}}"

      - log: "we started to get the balance"
      - get:
          url: "/api/wallet/balance/{{registration_id}}/{{wallet_type}}"
          name: "Get Balance"
          # beforeRequest: "addJsonDataforAddressVerify"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: getBalanceResponse
          expect:
            - statusCode: 200
      - log: "this is the data what we have got from the server: {{getBalanceResponse}}"

      - log: "we started to get all wallets"
      - get:
          url: "/api/wallets/{{registration_id}}"
          name: "Get All Wallets"
          # beforeRequest: "addJsonDataforAddressVerify"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: getAllWalletResponse
          expect:
            - statusCode: 200
      - log: "this is the data what we have got from the server: {{getAllWalletResponse}}"

      - log: "we started to update balance"
      - post:
          url: "/api/wallet/recharge"
          name: "Update Balance"
          beforeRequest: "addJsonDataforUpdateBalance"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postUpdateBalanceResponse
          expect:
            - statusCode: 200
      - log: "this is the data what we have got from the server: {{postUpdateBalanceResponse}}"

      - log: "we started to get system pricing"
      - get:
          url: "/api/pricing"
          name: "System Pricing"
          # beforeRequest: "addJsonDataforAddressVerify"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: getSystemPricingResponse
          expect:
            - statusCode: 200
      - log: "this is the data what we have got from the server: {{getSystemPricingResponse}}"

      - log: "we are started get the service types"
      - get:
          url: "/api/service/types"
          name: "get service types"
          # beforeRequest: "addRequestId"
          capture:
            json: "$"
            as: getServiceTypesResponse
          expect:
            - statusCode: 200
      - log: "this is the data what we have got from the server: {{getServiceTypesResponse}}"

      # - log: "we started to get Address Auto Complete"
      # - get:
      #     url: "api/address/list/{{address_line}}"
      #     name: "Address Auto Complete"
      #     # beforeRequest: "addJsonDataforAddressVerify"
      #     # afterResponse: "updateAddressId"
      #     capture:
      #       json: "$"
      #       as: getAddressAutoCompleteResponse
      #     expect:
      #       - statusCode: 200
      # - log: "this is the data what we have got from the server: {{getAddressAutoCompleteResponse}}"